atmosphere/tutorials/ce3/currentT400_NO_AMR/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];


internalField   nonuniform List<scalar> 
1024
(
298.038
298.038
298.038
298.038
298.038
298.038
298.038
298.038
...
)
;

boundaryField
{
    top
    {
        type            fixedGradient;
        gradient        uniform -0.00981;
    }
    bottom
    {
        type            fixedGradient;
        gradient        uniform 0.00981;
    }
    left
    {
        type            zeroGradient;
    }
    right
    {
        type            zeroGradient;
    }
    frontandback
    {
        type            empty;
    }
}


// ************************************************************************* //
